"""
На вход программе подается строка текста, содержащая натуральные числа, расположенные по неубыванию.
Из строки формируется список чисел. Напишите программу для подсчета количества разных элементов в списке.
"""
mySet = set(map(int, input().split()))
print(len(mySet))
